text = "Робота в ІТ передбачає постійне навчання та розвиток. Спеціалісти повинні\
 володіти технічними знаннями, вирішувати проблеми та ефективно співпрацювати в\
 командах для досягнення успіху в проєктах."

# Іванченко Олександр КН-33.2
# 1 Функція capitalize() передбачає виведення на екран тексту де перше слово з великої ліери, а всі інші з малої
capitalized_text = text.capitalize()
print("Переформатований текст:", capitalized_text)
# 2 Функція isdigit() передбачає перевірку на наявність цифр у тексті
if text.isdigit():
    print("\n Текст складається лише з цифр.")
else:
    print("\nТекст містить не тільки цифри.")
# 3 Функція partition() ділить рядок на три частини, до першого входження підрядка,сам підрядок і все після нього
partitioned_text = text.partition("навчання")
print("\nТекст розбитий на три частини:", partitioned_text)
